//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа

/*Console.Write("Введите трехзначное число: ");
int Value = Convert.ToInt32(Console.ReadLine());
int Length = Value.ToString().Length;
if (Length == 3)
{
    int result = (Value / 10) % 10;
    Console.WriteLine("Данным числом является " + result);
}
else
{
    Console.WriteLine("Введенное число не является трехзначным");
}
*/

//Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.